micropython/micropython/ports/esp32/boards/GARATRONIC_PYBSTICK26_ESP32C3/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME               "PYBSTICK26_ESP32C3"
#define MICROPY_HW_MCU_NAME                 "ESP32-C3"
#define MICROPY_PY_NETWORK_HOSTNAME_DEFAULT "pybstick26_esp32c3"

#define MICROPY_HW_I2C0_SCL                 (1)
#define MICROPY_HW_I2C0_SDA                 (0)

#define MICROPY_HW_SPI1_MOSI                (7)
#define MICROPY_HW_SPI1_MISO                (2)
#define MICROPY_HW_SPI1_SCK                 (6)
